code-review/NRB_3471_3546/База_Было/Catalogs/ПравилаФормированияКодовРазделовСчетовДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПравилаФормированияКодовРазделовСчетовДепо</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипРаздела</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРазделовСчетовДЕПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойИсточник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиФормированияКодовРазделовСчетовДЕПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Суффикс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СуффиксыФормированияКодовРазделовСчетовДЕПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксированныйСуффикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПервыхСимволовТипаРаздела</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДополнительныйИсточникЕслиОсновнойПустой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйИсточник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиФормированияКодовРазделовСчетовДЕПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИсточникСуффикс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СуффиксыФормированияКодовРазделовСчетовДЕПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИсточникФиксированныйСуффикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИсточникКоличествоПервыхСимволовТипаРаздела</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИсточникДобавлятьПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/СуффиксыФормированияКодовРазделовСчетовДЕПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СуффиксыФормированияКодовРазделовСчетовДЕПО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Фиксированный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПервыеNСимволовТипаРаздела</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Catalogs/ПравилаФормированияКодовРазделовСчетовДепо/Ext/ManagerModule.bsl
Функция КодРаздела(ТипРаздела, Знач НаименованиеРаздела, СчетДепо, Субклиент) Экспорт
	
	Код = "";
	//НаименованиеРаздела = СокрЛП(НаименованиеРаздела);
	Если ТипЗнч(СчетДепо) = Тип("СправочникСсылка.СчетаДепоМХ") Тогда
		ВидСправочникаРазделов = "РазделыСчетаДепоМХ";
	ИначеЕсли ТипЗнч(СчетДепо) = Тип("СправочникСсылка.СчетаДепо") Тогда
		ВидСправочникаРазделов = "РазделыСчетаДепо";
	Иначе
		Возврат "";
	КонецЕсли;
	//КодСчетаДепо = СокрЛП(СчетДепо.Код);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Правила.ОсновнойИсточник КАК ОсновнойИсточник,
	|	Правила.Суффикс КАК Суффикс,
	|	Правила.ФиксированныйСуффикс КАК ФиксированныйСуффикс,
	|	Правила.КоличествоПервыхСимволовТипаРаздела КАК КоличествоПервыхСимволов,
	|	Правила.ДобавлятьПорядковыйНомер КАК ДобавлятьПорядковыйНомер,
	|	Правила.ИспользоватьДополнительныйИсточникЕслиОсновнойПустой КАК ИспользоватьДопИсточник,
	|	Правила.ДополнительныйИсточник КАК ДополнительныйИсточник,
	|	Правила.ДопИсточникСуффикс КАК ДопИсточникСуффикс,
	|	Правила.ДопИсточникФиксированныйСуффикс КАК ДопИсточникФиксированныйСуффикс,
	|	Правила.ДопИсточникКоличествоПервыхСимволовТипаРаздела КАК ДопИсточникКоличествоПервыхСимволов,
	|	Правила.ДопИсточникДобавлятьПорядковыйНомер КАК ДопИсточникДобавлятьПорядковыйНомер
	|ИЗ
	|	Справочник.ПравилаФормированияКодовРазделовСчетовДепо КАК Правила
	|ГДЕ
	|	Правила.ТипРаздела = &ТипРаздела
	|	И НЕ Правила.ПометкаУдаления";
	Запрос.УстановитьПараметр("ТипРаздела", ТипРаздела);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ВходящиеДанные = Новый Структура("ВидСправочникаРазделов, ТипРаздела, НаименованиеРаздела, СчетДепо, Субклиент, КодСчетаДепо"
		, ВидСправочникаРазделов, ТипРаздела, СокрЛП(НаименованиеРаздела), СчетДепо, Субклиент, СокрЛП(СчетДепо.Код));
		
		ЗначениеОсновногоИсточника = "";
		
		Код = КодПоПравилам(Выборка.ОсновнойИсточник, Выборка.Суффикс, Выборка.ФиксированныйСуффикс
		, Выборка.КоличествоПервыхСимволов, Выборка.ДобавлятьПорядковыйНомер
		, ВходящиеДанные, ЗначениеОсновногоИсточника);
			
		Если ПустаяСтрока(ЗначениеОсновногоИсточника) И Выборка.ИспользоватьДопИсточник Тогда
			
			Код = КодПоПравилам(Выборка.ДополнительныйИсточник, Выборка.ДопИсточникСуффикс, Выборка.ДопИсточникФиксированныйСуффикс
			, Выборка.ДопИсточникКоличествоПервыхСимволов, Выборка.ДопИсточникДобавлятьПорядковыйНомер
			, ВходящиеДанные, ЗначениеОсновногоИсточника);
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Код;
	
КонецФункции

Функция КодПоПравилам(ВидИсточника, ВидДополнения, ФиксДополнение, КоличествоСимволов, ДобавлятьПорядковыйНомер, ВходящиеДанные, ЗначениеОсновногоИсточника)
	
	Если ВидИсточника = Перечисления.ИсточникиФормированияКодовРазделовСчетовДЕПО.КодСчетаДЕПО Тогда
		Код = ВходящиеДанные.КодСчетаДепо;
		Если ЗначениеЗаполнено(ВходящиеДанные.Субклиент) Тогда
			Позиция = 0; ДлинаКода = СтрДлина(Код);
			Пока Позиция < ДлинаКода И Найти("1234567890", Сред(Код, Позиция + 1, 1)) > 0 Цикл
				Позиция = Позиция + 1;
			КонецЦикла;
			Если Позиция > 0 Тогда
				Код = Лев(Код, Позиция) + "_" + ВходящиеДанные.Субклиент.Код + Сред(Код, Позиция + 1);
			Иначе
				Код = ВходящиеДанные.Субклиент.Код + Код; 
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ВидИсточника = Перечисления.ИсточникиФормированияКодовРазделовСчетовДЕПО.НаименованиеРазделаСчетаДЕПО Тогда
		Код = ВходящиеДанные.НаименованиеРаздела;
	Иначе
		Код = "";
	КонецЕсли;
	
	ЗначениеОсновногоИсточника = Код;
		
	Если ВидДополнения = Перечисления.СуффиксыФормированияКодовРазделовСчетовДЕПО.Фиксированный Тогда
		Код = Код + СокрЛП(ФиксДополнение);
		
	ИначеЕсли ВидДополнения = Перечисления.СуффиксыФормированияКодовРазделовСчетовДЕПО.ПервыеNСимволовТипаРаздела 
		И КоличествоСимволов > 0 Тогда
		Код = Код + Лев(ВходящиеДанные.ТипРаздела, КоличествоСимволов);
	КонецЕсли;		
	
	Если ДобавлятьПорядковыйНомер Тогда
		Код = СледующийКодРаздела(Код, ВходящиеДанные.ВидСправочникаРазделов);
	КонецЕсли;
	
	Возврат Код;
	
КонецФункции

// Находит код с максимальным номером и возвращает следующий код раздела счета депо в последовательности:
// Код, Код1, Код2 .. Код1000
Функция СледующийКодРаздела(Код, ВидСправочникаРазделов)
	Перем НовыйКод;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СправочникРазделы.Код КАК Код
	|ИЗ
	|	Справочник.РазделыСчетаДепоМХ КАК СправочникРазделы
	|ГДЕ
	|	СправочникРазделы.Код = &МаскаКод
	|	ИЛИ СправочникРазделы.Код ПОДОБНО &МаскаКодЧ
	|	ИЛИ СправочникРазделы.Код ПОДОБНО &МаскаКодЧЧ
	|	ИЛИ СправочникРазделы.Код ПОДОБНО &МаскаКодЧЧЧ
	|";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "РазделыСчетаДепоМХ", ВидСправочникаРазделов);
	КоличествоПробелов = Метаданные.Справочники[ВидСправочникаРазделов].ДлинаКода - СтрДлина(Код);
	Запрос.УстановитьПараметр("МаскаКод",	Код + СтрокаПробелов(КоличествоПробелов));
	Запрос.УстановитьПараметр("МаскаКодЧ",	Код + "[1-9]" + СтрокаПробелов(КоличествоПробелов-1));
	Запрос.УстановитьПараметр("МаскаКодЧЧ",	Код + "[1-9][0-9]" + СтрокаПробелов(КоличествоПробелов-2));
	Запрос.УстановитьПараметр("МаскаКодЧЧЧ",Код + "[1-9][0-9][0-9]" + СтрокаПробелов(КоличествоПробелов-3));
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		НовыйКод = Код;
	Иначе
		МаксимальныйСуффикс = 0;
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Суффикс = СтрЗаменить(Выборка.Код, Код, "");
			Если ЗначениеЗаполнено(Суффикс) Тогда
				СуффиксЧисло = Число(Суффикс);
			Иначе
				СуффиксЧисло = 0;
			КонецЕсли;
			
			Если МаксимальныйСуффикс < СуффиксЧисло Тогда
				МаксимальныйСуффикс = СуффиксЧисло;
			КонецЕсли;
		КонецЦикла;
		НовыйКод = Код + Формат(МаксимальныйСуффикс + 1, "ЧГ=0;");
	КонецЕсли;
	Возврат НовыйКод;
КонецФункции

Функция СтрокаПробелов(КоличествоПробелов)
	Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(" ", КоличествоПробелов);
КонецФункции
